public/man/man1/nm-online.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - nm-online.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - nm-online.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>nm-online - ask NetworkManager whether the network is connected</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>nm-online</strong> [/OPTIONS/…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>nm-online</strong> is a utility to find out whether we are online. It is done
by asking NetworkManager about its status. When run, <strong>nm-online</strong> waits
until NetworkManager reports an active connection, or specified timeout
expires. On exit, the returned status code should be checked (see the
return codes below).</p>
<p>
This tool is not very useful to call directly. It is however used by
NetworkManager-wait-online.service with –wait-for-startup argument (see
*NetworkManager-wait-online.service*(8)).</p>
<p>
By default, connections have the ipv4.may-fail and ipv6.may-fail
properties set to yes; this means that NetworkManager waits for one of
the two address families to complete configuration before considering
the connection activated. If you need a specific address family
configured before network-online.target is reached, set the
corresponding may-fail property to no.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-h</strong> | <strong>–help</strong></p>
<blockquote>
<p>Print help information.</p>
</blockquote>
<p>
<strong>-q</strong> | <strong>–quiet</strong></p>
<blockquote>
<p>Dont print anything.</p>
</blockquote>
<p>
<strong>-s</strong> | <strong>–wait-for-startup</strong></p>
<blockquote>
<p>Wait for NetworkManager startup to complete, rather than waiting for
network connectivity specifically. Startup is considered complete once
NetworkManager has activated (or attempted to activate) every
auto-activate connection which is available given the current network
state. This corresponds to the moment when NetworkManager logs &#34;startup
complete&#34;. This mode is generally only useful at boot time. After
startup has completed, <strong>nm-online -s</strong> will just return immediately,
regardless of the current network state.</p>
<p>
There are various ways to affect when startup complete is reached. For
details see *NetworkManager-wait-online.service*(8).</p>
</blockquote>
<p>
<strong>-t</strong> | <strong>–timeout</strong> <em>seconds</em></p>
<blockquote>
<p>Time to wait for a connection, in seconds. If the option is not
provided, the environment variable NM_ONLINE_TIMEOUT is honored. The
default timeout is 30 seconds.</p>
</blockquote>
<p>
<strong>-x</strong> | <strong>–exit</strong></p>
<blockquote>
<p>Exit immediately if NetworkManager is not running or connecting.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXIT STATUS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>nm-online</strong> exits with status 0 if it succeeds, a value greater than 0
is returned if an error occurs.</p>
<p>
<strong>0</strong></p>
<blockquote>
<p>Success already online or connection established within given timeout.</p>
</blockquote>
<p>
<strong>1</strong></p>
<blockquote>
<p>Offline or not online within given timeout.</p>
</blockquote>
<p>
<strong>2</strong></p>
<blockquote>
<p>Unknown or unspecified error.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*nmcli*(1), *NetworkManager*(8),
*NetworkManager-wait-online.service*(8).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
